using System;

// ## Program_6.cs   <br>  Двумерные массивы и рекурсия
// -Задача 41.Пользователь вводит с клавиатуры M чисел. Посчитайте, сколько чисел больше 0 ввёл пользователь.0, 7, 8, -2, -2 -> 2-1, -7, 567, 89, 223-> 3
// -  Напишите программу, которая найдёт точку пересечения двух прямых, заданных уравнениями y = k1 * x + b1, y = k2 * x + b2; значения b1, k1, b2 и k2 задаются пользователем.b1 = 2, k1 = 5, b2 = 4, k2 = 9-> (-0, 5; -0,5)
// -Задача 1.Написать перевод десятичного числа в двоичное, используя рекурсию.
// - На вход подаётся поговорка “без труда не выловишь и рыбку из пруда”. Используя рекурсию, подсчитайте, сколько в поговорке гласных букв.
// - Дано число N. Используя только операцию деления и рекурсию, определите, что оно является степенью числа 3.


namespace Arrays2DAndRecursion
{
   internal class Program
   {
      static void Main()
      {
         Console.WriteLine("Hello World!");
      }
   }
}
